Tekla Open API Reference for Tekla Structures 2025
RebarSpacingZone.NumberOfSpacesType Property
 Gets or sets a value indicating whether the number of spaces is exact or target. If the number of spaces is target the spacing algorithm may determine a different number of spaces to use.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public RebarSpacingZone.SpacingEnum NumberOfSpacesType { get; set; }
Public Property NumberOfSpacesType As RebarSpacingZone.SpacingEnum
	Get
	Set
Property Value
Type: RebarSpacingZone.SpacingEnum
See Also
Reference
RebarSpacingZone Class
Tekla.Structures.Model Namespace